Table of Contents
 Class IdeaModel
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class IdeaModel : BimLinkObject, IIdeaModel
Inheritance
object
ScopeAwareObject
BimLinkObject
IdeaModel
Implements
IIdeaModel
Inherited Members
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 GetBulkSelection()
Returns currently selected nodes and/or members. At least one of the sets must be non-empty unless the user did not select anything. Set of returned members must be a subset of GetMembers().
public BulkSelection GetBulkSelection()
Returns
BulkSelection
 GetLoads()
Returns a set of all loads in the model.
public virtual ISet<IIdeaLoading> GetLoads()
Returns
ISet<IIdeaLoading>
Set of all loads in the model.
 GetMembers()
Returns a set of all members in the model.
public virtual ISet<IIdeaMember1D> GetMembers()
Returns
ISet<IIdeaMember1D>
Set of all members in the model.
 GetOriginSettings()
Returns information from the original application about the project this class refers to.
public abstract OriginSettings GetOriginSettings()
Returns
OriginSettings
Project information
 GetSelection(out ISet<IIdeaNode>, out ISet<IIdeaMember1D>)
public abstract void GetSelection(out ISet<IIdeaNode> nodes, out ISet<IIdeaMember1D> members)
Parameters
nodes ISet<IIdeaNode>
members ISet<IIdeaMember1D>
 GetSingleSelection()
Returns currently selected node and/or member. At least one of the sets must be non-empty unless the user did not select anything.Set of returned members must be a subset of GetMembers().
public SingleSelection GetSingleSelection()
Returns
SingleSelection
 GetWholeModel()
Returns nodes and/or members from whole model. At least one of the sets must be non-empty unless the user did not select anything. Set of returned members must be a subset of GetMembers().
public BulkSelection GetWholeModel()
Returns
BulkSelection
 Edit this page